/*
    -- Loop --
    while ( เงื่อนไข ){
    
    }
    ++++++++++++++++++++++++++++
    do{
        คำสั่ง...
    }while( เงื่อนไข );
    ++++++++++++++++++++++++++++
    for( ตัวแปรพร้อมค่าเริ่มต้น ; เงื่อนไข ; การเพิ่มตัวแปร ){
        คำสั่ง...
    }
*/

#include <stdio.h>
int main(){
    int i;

    for(i = 1; i <= 5; i++){
        printf("%d - Hello...", i);
    }

    printf("\n----------------\n");

    i = 1;
    while(i <= 5){
        printf("%d - Hi...", i);
        i++;
    }

    printf("\n----------------\n");
    
    i = 1;
    do{
        printf("%d - Hey...", i);
        i++;
    } while(i <= 5);

}